// 1. Создать объект Point, содержащий два свойства: "x" и "y" — координаты точки, и метод GetQuadrant, вычисляющий, в каком квадранте в декартовой системе координат находится данная точка. Протестируйте данный объект, изменяя значения его координат, и повторно вызавая метод GetQuadrant.
// OK
var Point = {
    x:-5,
    y:5,
    GetQuadrant: function(){
        if (this.x > 0 && this.y > 0){
            console.log("Точка находиться у першому квадранті декадової системи координат")
        }
        else if( this.x > 0 && this.y < 0){
            console.log("Точка находиться у четвертому квадранті декадової системи координат")
        }
        else if( this.x < 0 && this.y < 0){
            console.log("Точка находиться у третьому квадранті декадової системи координат")
        }
        else if( this.x < 0 && this.y > 0){
            console.log("Точка находиться у другому квадранті декадової системи координат")
        }
    }

}
console.log(Point);
Point.GetQuadrant();